<?php
    /**
     * define(常量名, 常量值)
     * 
     * 1、常量值只能为上一章中我们讲到的标量
     * 2、常量名可以小写，但通常大写
     * 3、常量名可以不加引号，但通常加引号
     * 4、在字符串中条用常量的时候，必须在引号外面
     * 5、常量名建议只用字母和下划线
     */


    /**
     * PHP内置常量
     * 
     * LINE             当前所在行
     * FILE             当前文件在服务器的路径
     * FUNCTION         当前函数名
     * CLASS            当前类名
     * METHOD           当前成员方法名
     * PHP_OS           PHP运行的操作系统
     * PHP_VERSION      当前PHP的版本
     * TRAIT            Trait的名字，php5.4新加
     * DIR              文件所在的目录
     * NAMESPACE        当前命名空间的名称（区分大小写）
     */ 
?>